Pandas Series

In [4]:
import numpy as np;

In [5]:
import pandas as pd;

In [20]:
labels = ['a', 'b', 'c']
my_data = [10, 20, 30]
arr = np.array (my_data)
d = {'a':10, 'b': 20, 'c':30}

In [21]:
d

{'a': 10, 'b': 20, 'c': 30}

In [22]:
pd.Series(data = my_data) # returns a series with the data contents

0    10
1    20
2    30
dtype: int64

In [23]:
pd.Series (data = my_data, index = labels) # returns series with my_data vals
                                           # and indexing according to labels'
                                           # correlated values

a    10
b    20
c    30
dtype: int64

In [25]:
pd.Series (my_data, labels) # alt. form of doing the above; format: (<data>, <index>)

a    10
b    20
c    30
dtype: int64

In [27]:
pd.Series(arr) # works similar to lists

0    10
1    20
2    30
dtype: int32

In [28]:
pd.Series (arr, labels)

a    10
b    20
c    30
dtype: int32

In [29]:
pd.Series (d)

a    10
b    20
c    30
dtype: int64

In [30]:
pd.Series (data = [sum, print, len]) # we can pass functions into the series!!!

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [31]:
# ^!!!!!!!! :O :O :O :O :O :O

In [32]:
tseries = pd.Series([1, 2, 3, 4], ['USA', 'Germany', 'USSR', 'Japan'])

In [33]:
tseries

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [34]:
t2series = pd.Series ([1, 2, 5, 4], ['USA', 'Germany', 'Italy', 'USSR'])

In [35]:
t2series

USA        1
Germany    2
Italy      5
USSR       4
dtype: int64

In [36]:
tseries['USA']

1

In [37]:
t3series = pd.Series (data = labels)

In [38]:
t3series

0    a
1    b
2    c
dtype: object

In [39]:
t3series[0]

'a'

In [41]:
tseries + t2series # adds them for correlated key vals. Italy and Japan are unique to each series

Germany    4.0
Italy      NaN
Japan      NaN
USA        2.0
USSR       7.0
dtype: float64

In [42]:
# NOTE: Converts ints into floats to prevent data loss! for all numpy arr and series ops, etc.

DATAFRAMES

In [44]:
from numpy.random import randn

In [45]:
np.random.seed(101)

In [46]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])
# DataFrame constructor format: (<data>, <rows>, <cols>)

In [47]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [48]:
# ^ A Dataframe is a collection of series objects!

In [50]:
df['W'] # returns 'W' column

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [51]:
type(df['W'])

pandas.core.series.Series

In [52]:
type(df)

pandas.core.frame.DataFrame

In [54]:
df.W # Discouraged to use this as it can be confused with diff. methods

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [55]:
df[['W', 'Z']] # to illustrate that requesting multi-cols. returns a dataframe

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [56]:
df['W'] # but a single returns a  series

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [57]:
# creating a new column....
df['new']

KeyError: 'new'

In [58]:
# creating a new column....
df['new'] = df ['W'] + df['Y']

In [59]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [62]:
df.drop('new', axis = 1) # to get rid of a row; set axis val to 0 for rows and 1 for cols

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [64]:
df # but the 'new' col still exists in df!!!

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [65]:
 # Therefore... to drop it from the actual dataframe, we set the inplace val to 'True'

In [68]:
df.drop('new', axis = 1, inplace = True)

In [69]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
# to drop a row...

In [71]:
df.drop ('E', inplace = True)

In [72]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [78]:
df.shape # in order to understand the axes: the index of a shape
         # from the shape tuple, the (<row>, <col>) => indices [0, 1]
         # with row @ index 0 and col @ index 1;  
         # therefore, axis == 0 == rows and axis == 1 == cols

(4, 4)

In [85]:
df.loc['E'] = pd.Series ([0.190794, 1.978757, 2.605967, 0.683509], ['W', 'X', 'Y', 'Z']);

In [86]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [79]:
# to select rows...
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [87]:
 # for getting access via a numerical indexing approach
df.iloc[1] # to get row 'B' ==> index: 1

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [88]:
# for selecting subsets

In [89]:
df.loc['B', 'Y'] # to get val from row 'B' and col 'Y'

-0.8480769834036315

In [90]:
df.loc[ ['A', 'B'], ['W', 'Y'] ]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [92]:
df.loc[ ['C', 'E'], ['X', 'Z'] ] # NOTE: only gets specified rows!

          X         Z
C  0.740122 -0.589001
E  1.978757  0.683509

In [93]:
df.loc[ ['C' : 'E'], ['X' : 'Z'] ]

SyntaxError: invalid syntax (Temp/ipykernel_840/2910509314.py, line 1)

In [96]:
df.loc[ [3:], [1:] ]

SyntaxError: invalid syntax (Temp/ipykernel_840/223810794.py, line 1)

In [97]:
df.iloc[ [3:], [1:] ]

SyntaxError: invalid syntax (Temp/ipykernel_840/2596534101.py, line 1)

In [95]:
# NOTE: THE START-STOP NOTATION DOESN'T WORK HERE!

CONDITIONAL SELECTION

In [99]:
df > 0 # returns dataframe with conditional operation on each value in df

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [102]:
booldf = df > 0;

In [103]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [105]:
df [booldf] # returns df vals for wherever booldf is True and null/NaN for the rest

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [107]:
df[ df > 0] # uncommon

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [108]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [112]:
df ['W'] > 0 # common

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [111]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [113]:
df [df['W'] > 0] # common

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [114]:
# NOTE: row 'C' is absent since df['W'] > 0 was False for that one!

In [115]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [116]:
df [df['Z'] < 0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [121]:
# NOTE: we always get dataframes as return vals.!

In [122]:
# This....

In [118]:
resultdf = df[df['W'] > 0]

In [120]:
resultdf['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [123]:
# can also be written as....

In [124]:
df[df['W'] > 0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [126]:
df[df['W'] > 0][['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [127]:
boolSeries = df['W'] > 0 # returns series with boolean vals based on conditional
result = df[boolSeries] # assigns returned dataframe based on bool vals. to result

In [128]:
result

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [129]:
result[['Y', 'X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [132]:
# or... as:
myCols = ['Y', 'X']

In [133]:
result[myCols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [134]:
# for 2 or more conditionals....

In [135]:
df[(df['W'] > 0) and (df['Y'] > 1)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [138]:
# python 'and'/'or' CANNOT take a series of bools and compare them to another series of bools!

In [139]:
# it can only process singular true-false(s)
True and False

False

In [141]:
# so replace 'and' with '&' for multiple bool comparisons
df[(df['W'] > 0) & (df['Y'] > 1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [144]:
df[(df['W'] > 0) | (df['Y'] > 1)] # similarly... for 'or', replace with '|'

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [145]:
# indices

In [146]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [147]:
# to reset the row indices back to numerical vals....
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [148]:
# NOTE: ^ This is not inplace! to get it inplace, we must call it with inspace = True
# eg:
# df.reset_index(inplace = True)

In [149]:
# setting the index:

In [153]:
newInd = 'CA NY WY OR CO'.split();

In [154]:
newInd

['CA', 'NY', 'WY', 'OR', 'CO']

In [155]:
df['States'] = newInd

In [156]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [158]:
df.set_index('States') # will overwrite old index and set new index for passed col

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [160]:
df # again.... not inplace

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [161]:
# for inplace:
# df.set_index('States', inplace = True)

MULTI-INDEX AND INDEX-HIERARCHY

In [171]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside)) # makes it a list of tuple pairs
hier_index = pd.MultiIndex.from_tuples(hier_index) # a special fucntion in pandas

In [172]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [173]:
inside

[1, 2, 3, 1, 2, 3]

In [175]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [176]:
pd.MultiIndex.from_tuples(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [177]:
df = pd.DataFrame(randn(6, 2), hier_index, ['A', 'B'])

In [178]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [179]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [180]:
df.loc['G1'].loc[1]

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [181]:
# NOTE: therefore, we go from outside cols --> inside cols/subsets

In [182]:
df.index.names

FrozenList([None, None])

In [183]:
# ^ what that means is that those indices don't have any assigned names

In [184]:
df.index.names = ['Groups', 'Num']

In [185]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [186]:
df.loc['G2'].loc[2].loc['B']

0.07295967531703869

In [187]:
# or...
df.loc['G2'].loc[2]['B']

0.07295967531703869

In [188]:
# cross section....

In [189]:
df.xs # use it for a multi-level index scheme

<bound method NDFrame.xs of                    A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646>

In [190]:
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [191]:
# xs can 'skip'/'go inside' multi-level indices

In [192]:
df.xs(1, level = 'Num') # this will return 1 data vals

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502

In [ ]:
# this would be
df.loc[]

MISSING DATA PROBLEMS

Usually, when we have missing data vals., pandas will fill those in with null/NaN values. We can deal with this by using methods like 'dropNa' or 'fillNa'

In [213]:
d = {'A': [1, 2, np.nan], 'B': [5, np.nan, np.nan], 'C': [1, 2, 3]}

In [216]:
df = pd.DataFrame(d)

In [217]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [218]:
df.dropna() # this drops the rows containing any NaN values!

     A    B  C
0  1.0  5.0  1

In [219]:
df.dropna(axis = 1) # do the same but for cols

   C
0  1
1  2
2  3

In [226]:
df.dropna(thresh = 1) # thresh argument basically adds a toleration no. for NaN values per row
# NOTE: thresh value denotes how many *non-NaN* values we will tolerate

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [227]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [228]:
# fillna()
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [229]:
# for fillinf in the values for the mean of the value
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [230]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

 GROUP-BY

Groupby() allows us to group rows based on columns. eg: all cols. with val. 1 can be grouped into a single row with an aggregate function for col. val. 1 and the corresponding cols. in that row

examples of aggregate functions:
    1) sum
    2) mean
    3) standard deviation

In [231]:
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [232]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [235]:
df = pd.DataFrame(data);

In [236]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [240]:
# function syntax: groupby(<col. Name>).< aggregate function to be performed>()
byComp = df.groupby('Company')

In [238]:
byComp

In [241]:
byComp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [242]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [243]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [244]:
byComp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [245]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [246]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [248]:
df.groupby('Company').max() # this organizes the data based on highest alphabet value per person (last alpha)

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [249]:
df.groupby('Company').min() # this organizes the data based on lowest alphabet value per person (first alpha)

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [250]:
df.groupby('Company').describe() # returns a bunch of useful stats about data

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [252]:
# transpose...
df.groupby('Company').describe().transpose() # returns a bunch of useful stats about data

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [253]:
df.groupby('Company').describe().transpose()['FB'] # returns a bunch of useful stats about data based on row

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

MERGING, JOINING AND CONCATENATING DATA FROM DATAFRAMES

In [254]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [255]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [256]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [257]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [258]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [259]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [260]:
# NOTE: Notice how all the index vals. for the rows are disjointed per dataframe

Concatenation: basically 'glues' together dataframes

In [261]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [262]:
# NOTE: we would specify the axis (=1) if we wanted to concat along cols.
# eg: pd.concat([df1, df2, df3], axis = 1)

In [268]:
pd.concat([df1, df2, df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [269]:
# we will usually be joining cols. though

In [270]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [271]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [272]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [273]:
# NOTE: Notice here how all the data vals. are disjointed for cols. here!

Merging: Similar to merge() on SQL tables

In [279]:
# format: merge(<table1>, <table2>, <how; default val. = 'inner'>, <on; for keeping the key vals. intact and distinct, unlike in concat > )
pd.merge(left, right, how= 'inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [281]:
pd.merge(left, right, how= 'outer', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [283]:
# now... with *2* keys instead of 1
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [286]:
pd.merge(left, right, on= ['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [287]:
pd.merge(left, right, how = 'outer', on= ['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [288]:
pd.merge(left, right, how = 'right', on= ['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [290]:
pd.merge(left, right, how = 'left', on= ['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

Joining: for combining columns of 2 portentially differently-indexed DataFrames into a single DataFrame

NOTE: Similar to merge, but with keys at the index instead of the cols.

In [291]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [292]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [293]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [294]:
# format: <table1>.join(<table2>, <how; default val: 'innner'>)
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [295]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

Operations

In [297]:
df = pd.DataFrame({'col1':[1,2,3,4],
                   'col2':[444,555,666,444],
                   'col3':['abc','def','ghi','xyz']})

In [298]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [299]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [300]:
# for finding unique values within a dataframe:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [302]:
# to get number of unique values within a dataframe....
len(df['col2'].unique())

3

In [303]:
# or......

In [304]:
df['col2'].nunique()

3

In [306]:
df['col3'].unique()

array(['abc', 'def', 'ghi', 'xyz'], dtype=object)

In [307]:
# for getting a table/dataframe of unique values and how many times they show up...
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [308]:
# NOTE: 444 is 2 because it occurs twice in col2

In [309]:
# for selecting data....
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [311]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [314]:
df[(df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [315]:
# apply method....

In [316]:
def times2(x):
    return x*2

In [317]:
df['col1'].sum()

10

In [318]:
df['col1'].apply(times2) # format: <series/Datafrane>.apply(<function>)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [319]:
df.apply(times2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [320]:
# we can also use apply on built-in functions

In [321]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [323]:
df['col2'].apply(lambda x: x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

In [324]:
df.apply(lambda x: x*2)

   col1  col2    col3
0     2   888  abcabc
1     4  1110  defdef
2     6  1332  ghighi
3     8   888  xyzxyz

In [325]:
# NOTE: apply() is one of the most powerful functions in pandas!

In [326]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [328]:
df.drop('col1', axis=1) # axis = 1 since it's a column we wish to drop

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [329]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [331]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [332]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

Operations for Sorting and ordering a dataframe:

In [333]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [334]:
# we can use sort_values to sort a dataframe
# format: sort_values(<by column...>, <>)
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [335]:
# NOTE: Index values are not reshuffled! The items instead get indexes reassigned
#       based on new index values!

In [336]:
# to find null values in dataframe...

In [338]:
df.isnull() # returns a boolean dataframe based on whether a cell has a null val. or not

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [344]:
# pivot tables

In [345]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [346]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [347]:
# NOTE: Notice the repeating values in each column....

In [348]:
# pivot tables basically create a multi-index table from the table
# format: <table>.pivot_table(<values>, <index>, <columns>)
df.pivot_table(values = 'D', index = ['A', 'B'], columns= 'C') 
# we shall pivot along col. 'D', make the 'A' and 'B' indexes into multi-level
# indices and make the columns be defined by the 'C' column

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [349]:
# NOTE: Since there is no value for 'bar-two-x' and 'foo-two-y' in the original
#       dataframe, those values are null/NaN

DATA INPUT & OUTPUT

We will go over:
    - CSV
    - Excel
    - HTML
    - SQL

We need the following packages to work on these:
    conda install (package)
        - sqlalchemy
        - lxml
        - html5lib
        - BeautifulSoup4

In [357]:
pd.read_csv('example') # reads example.csv file in local directory

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [358]:
df = pd.read_csv('example')

In [359]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [366]:
df.to_csv('My_output', index = False) # saves the file as 'My_output' without the index column

In [367]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [368]:
# now for excel files...

In [369]:
# NOTE: pandas can ONLY import data; not the custom formulas or images, macros, etc.
#       in fact, trying to use a read_excelMethod() might cause pandas to crash

In [370]:
# for pandas, a workbook is a bunch/collective of sheets and
# each sheet, is a dataframe

In [382]:
pd.read_excel('Excel_Sample.xlsx', sheet_name = 'Sheet1').drop('Unnamed: 0', axis=1)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [383]:
df.to_excel('Excel_Sample2.xlsx', sheet_name = 'NewSheet')

In [384]:
pd.read_excel('Excel_Sample2.xlsx', sheet_name = 'NewSheet')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [386]:
# now for html.... (he he he he)

In [388]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [389]:
data

[                         Bank NameBank           CityCity StateSt  CertCert  \
 0                    Almena State Bank             Almena      KS     15426
 1           First City Bank of Florida  Fort Walton Beach      FL     16748
 2                 The First State Bank      Barboursville      WV     14361
 3                   Ericson State Bank            Ericson      NE     18265
 4     City National Bank of New Jersey             Newark      NJ     21111
 ..                                 ...                ...     ...       ...
 558                 Superior Bank, FSB           Hinsdale      IL     32646
 559                Malta National Bank              Malta      OH      6629
 560    First Alliance Bank & Trust Co.         Manchester      NH     34264
 561  National State Bank of Metropolis         Metropolis      IL      3815
 562                   Bank of Honolulu           Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0                            Equity Bank    October 23, 2020     10538
 1              United Fidelity Bank, fsb    October 16, 2020     10537
 2                         MVB Bank, Inc.       April 3, 2020     10536
 3             Farmers and Merchants Bank   February 14, 2020     10535
 4                        Industrial Bank    November 1, 2019     10534
 ..                                   ...                 ...       ...
 558                Superior Federal, FSB       July 27, 2001      6004
 559                    North Valley Bank         May 3, 2001      4648
 560  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 561              Banterra Bank of Marion   December 14, 2000      4646
 562                   Bank of the Orient    October 13, 2000      4645

 [563 rows x 7 columns]]

In [392]:
# NOTE: pandas imported the table from the page as a list
#       in order to get the table as a dataframe... we'll have to ...

In [393]:
data[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [394]:
# now for SQL...

In [396]:
# due to different versions/flavors of sql, out approach to it will vary
# for example, we'll need to use:
#    <SQL driver> - <library>
#    postgresSQL - cyclePG2
#    mySQL - pimysql/pymysql

In [397]:
from sqlalchemy import create_engine

In [400]:
# this creates a very temporary, very small sqlite engine database 
# that is running in memory
engine = create_engine('sqlite:///:memory:')

In [401]:
# format: <dataframe/table>.to_sql(<name4Table>, <connection; 'engine' variable here>)
df.to_sql('my_table', engine)

In [402]:
sqldf = pd.read_sql('my_table', con=engine)

In [403]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

In [1]:
# corr(): this function maps a correlation between different columns
# syntax df.corr()